"""
Функция len - получение количества элементов в словаре.
"""

# Последовательность кортежей
top_ten = (("Россия", "Москва"),
           ("Канада", "Оттава"),
           ("Китай", "Пекин"),
           ("США", "Вашингтон"),
           ("Бразилия", "Бразилия"),
           ("Австралия", "Канберра"),
           ("Индия", "Нью-Дели"),
           ("Аргентина", "Буэнос-Айрес"),
           ("Казахстан", "Астана"),
           ("Алжир", "Алжир"))

print(f"Количество элементов в словаре: {len(top_ten)}")

