"""
Одной из самых полезных структур данных Python является словарь.

Словарь - это объект-контейнер, который хранит коллекцию данных.
Каждый элемент в словаре имеет две части: ключ и значение.


Словари Python, как и списки и кортежи, предназначены для хранения коллекций объектов. Но вместо того, чтобы хранить
объекты в последовательности, словари хранят информацию в виде пар данных «ключ — значение».
Другими словами, каждый объект в словаре состоит из двух частей: ключа и значения

Словари - фундаментальная чать реализации Python.
В силу своей важности словари высокооптимизированы.
"""

car = {'модель': 'Audi A5 Sportback', 'цвет': 'красный', 'пробег': '100500 км'}


hr_info = {'сотрудник1': {'имя': 'Егор', 'должность': 'пентестер'},
           'сотрудник2': {'имя': 'Михаил', 'должность': 'DevOps'},
           'сотрудник3': {'имя': 'Татьяна', 'должность': 'фронтендер'}
           }

user_data = {"name": "Guido van Rossum", "programming_skills": ["Python", "C", "C++", "SQL"]}